Repository: nonefffds/rotary
Catalog: host/winui/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# SerialHeader.Text
source: Serial
ja_jp: シリアル
zh_cn: 串口

# PortLabel.Text
source: Port:
ja_jp: ポート：
zh_cn: 端口：

# RefreshButton.Content
source: Refresh
ja_jp: 更新
zh_cn: 刷新

# StartButton.Content
source: Start monitoring
ja_jp: 監視開始
zh_cn: 开始监控

# SensorButton.Content
source: Sensor view...
ja_jp: センサービュー...
zh_cn: 传感器视图...

# StatusText.Text
source: Stopped
ja_jp: 停止中
zh_cn: 已停止

# WallpaperHeader.Text
source: Wallpaper
ja_jp: 壁紙
zh_cn: 壁纸

# ModeBothRadio.Content
source: All monitors
ja_jp: すべてのモニター
zh_cn: 所有显示器

# ModeMainRadio.Content
source: Rotation monitor only
ja_jp: 回転モニターのみ
zh_cn: 仅旋转显示器

# WallpaperHint
source: Each monitor gets the image matching its own orientation — landscape for horizontal, portrait for vertical.
ja_jp: 各モニターは自分の向きに合った画像を使用します——横向きは横向き用、縦向きは縦向き用です。
zh_cn: 每台显示器会使用与自身方向匹配的图片——横屏用横屏图，竖屏用竖屏图。

# LandscapeLabel.Text
source: Landscape:
ja_jp: 横向き：
zh_cn: 横屏：

# PortraitLabel.Text
source: Portrait:
ja_jp: 縦向き：
zh_cn: 竖屏：

# SecondaryLabel.Text
source: Secondary color:
ja_jp: 背景色：
zh_cn: 辅助颜色：

# MappingHeader.Text
source: Mapping
ja_jp: マッピング
zh_cn: 映射

# State1Label.Text
source: Portrait direction 1 -> rotate to:
ja_jp: 縦方向 1 → 回転先：
zh_cn: 竖屏方向 1 → 旋转为：

# State3Label.Text
source: Portrait direction 2 -> rotate to:
ja_jp: 縦方向 2 → 回転先：
zh_cn: 竖屏方向 2 → 旋转为：

# MappingHint
source: Calibration sets the accessory’s mounting offset. Upright = 0°, right edge down = 90°, upside down = 180°, left edge down = 270°.
ja_jp: 校正でセンサーの取り付けオフセットを設定します。横向き = 0°、右端が下 = 90°、逆さま = 180°、左端が下 = 270°。
zh_cn: 校准可设置传感器安装偏移。横屏为 0°，右边缘朝下为 90°，倒置为 180°，左边缘朝下为 270°。

# CalButton
source: Calibrate...
ja_jp: 校正...
zh_cn: 校准...

# CalStatus
source: Mounting offset: {0}°
ja_jp: 取り付けオフセット：{0}°
zh_cn: 安装偏移：{0}°

# CalNotCalibrated
source: Not calibrated (default 0°)
ja_jp: 未校正（既定 0°）
zh_cn: 未校准（默认 0°）

# CalTitle
source: Calibrate mounting orientation
ja_jp: 取り付け方向の校正
zh_cn: 校准安装方向

# CalIntro
source: Attach the accessory to the monitor, keeping the monitor horizontal (landscape).
ja_jp: アクセサリーをモニターに取り付け、モニターを横向き（ランドスケープ）に保ちます。
zh_cn: 将传感器装置固定到显示器上，保持显示器为横屏。

# CalChoose
source: Choose the direction you will rotate the monitor, rotate it to that position, then press Capture.
ja_jp: 回転させる方向を選択し、その位置までモニターを回転して、“取得”を押します。
zh_cn: 选择将要旋转的方向，旋转显示器到该位置，然后点击“捕获”。

# CalCapture
source: Capture orientation
ja_jp: 方向を取得
zh_cn: 捕获方向

# CalDone
source: Calibration complete. Mounting offset: {0}°
ja_jp: 校正完了。取り付けオフセット：{0}°
zh_cn: 校准完成。安装偏移：{0}°

# CalLive
source: Current angle:
ja_jp: 現在の角度：
zh_cn: 当前角度：

# CalFinish
source: Finish
ja_jp: 完了
zh_cn: 完成

# CalNoData
source: Waiting for sensor data...
ja_jp: センサーデータを待っています...
zh_cn: 正在等待传感器数据...

# TestHeader.Text
source: Test (applies rotation immediately)
ja_jp: テスト（即時回転）
zh_cn: 测试（立即旋转）

# TestLandscapeButton.Content
source: Landscape
ja_jp: 横向き
zh_cn: 横屏

# TestPortrait90Button.Content
source: Portrait 90
ja_jp: 縦90
zh_cn: 竖屏 90

# TestPortrait270Button.Content
source: Portrait 270
ja_jp: 縦270
zh_cn: 竖屏 270

# TestFlippedButton.Content
source: Flipped 180
ja_jp: 反転180
zh_cn: 翻转 180

# ApplyOnStartupCheck.Content
source: Apply current orientation when the app starts
ja_jp: 起動時に現在の向きを適用
zh_cn: 启动时应用当前方向

# LanguageLabel.Text
source: Language:
ja_jp: 言語：
zh_cn: 语言：

# SaveButton.Content
source: Save settings
ja_jp: 設定を保存
zh_cn: 保存设置

# LogHeader.Text
source: Log
ja_jp: ログ
zh_cn: 日志

# OptionsHeader
source: Options
ja_jp: オプション
zh_cn: 选项

source: Start with Windows
ja_jp: Windows と一緒に起動
zh_cn: 随 Windows 启动

# AppSubtitle
source: Monitor rotation switch · D1 Mini + BMI160
ja_jp: モニター回転スイッチ · D1 Mini + BMI160
zh_cn: 显示器旋转切换 · D1 Mini + BMI160

# MsgStartupOn
source: Start with Windows enabled.
ja_jp: Windows 起動を有効にしました。
zh_cn: 已启用随 Windows 启动。

# MsgStartupOff
source: Start with Windows disabled.
ja_jp: Windows 起動を無効にしました。
zh_cn: 已禁用随 Windows 启动。

# MsgPickPortTitle
source: No COM port
ja_jp: COMポートがありません
zh_cn: 没有串口

# MsgAutoPickedPort
source: Auto-picked port {0}.
ja_jp: ポート {0} を自動選択しました。
zh_cn: 已自动选择串口 {0}。

# MsgCloseSensorFirst
source: Close the sensor view before starting monitoring.
ja_jp: 監視を開始する前にセンサービューを閉じてください。
zh_cn: 请先关闭传感器视图再开始监控。

# NavMonitor
source: Monitor
ja_jp: モニター
zh_cn: 显示器设置

# NavWallpaper
source: Wallpaper
ja_jp: 壁紙
zh_cn: 壁纸

# NavOptions
source: Options
ja_jp: オプション
zh_cn: 选项

# NavLog
source: Log
ja_jp: ログ
zh_cn: 日志

# AutoRestart
source: Auto-restart on crash
ja_jp: クラッシュ時に自動再起動
zh_cn: 崩溃时自动重启

source: Restart now
ja_jp: 今すぐ再起動
zh_cn: 立即重启

# MsgAutoRestartOn
source: Auto-restart on crash enabled.
ja_jp: クラッシュ時の自動再起動を有効にしました。
zh_cn: 已启用崩溃时自动重启。

# MsgAutoRestartOff
source: Auto-restart on crash disabled.
ja_jp: クラッシュ時の自動再起動を無効にしました。
zh_cn: 已禁用崩溃时自动重启。

# RotateTargetLabel
source: Rotation target:
ja_jp: 回転対象：
zh_cn: 旋转目标：

# PrimaryMonitor
source: primary
ja_jp: メイン
zh_cn: 主屏

# SensorFlipped
source: Flipped (180°)
ja_jp: 反転（180°）
zh_cn: 翻转（180°）

# SensorNote.Text
source: Read-only view — Windows rotation / wallpaper are NOT changed.
ja_jp: 読み取り専用ビュー — 回転や壁紙は変更されません。
zh_cn: 只读视图 — 不会旋转显示器或更改壁纸。

# StatusStopped
source: Stopped
ja_jp: 停止中
zh_cn: 已停止

# StatusConnected
source: Connected: {0}
ja_jp: 接続中：{0}
zh_cn: 已连接：{0}

# StatusDisconnected
source: Disconnected
ja_jp: 未接続
zh_cn: 未连接

# PortStart
source: Start monitoring
ja_jp: 監視開始
zh_cn: 开始监控

# PortStop
source: Stop monitoring
ja_jp: 監視停止
zh_cn: 停止监控

# LangSystem
source: System default
ja_jp: システム既定
zh_cn: 系统默认

# MsgSettingsSaved
source: Settings saved to {0}
ja_jp: 設定を保存しました：{0}
zh_cn: 设置已保存到 {0}

# MsgPorts
source: Ports: {0}
ja_jp: ポート：{0}
zh_cn: 端口：{0}

# MsgStopping
source: Stopping...
ja_jp: 停止中...
zh_cn: 正在停止...

# MsgOpenSensor
source: Opening read-only sensor view on {0} (no changes applied).
ja_jp: 読み取り専用のセンサービューを開きます：{0}（変更は適用されません）
zh_cn: 正在打开只读传感器视图 {0}（不应用任何更改）。

# MsgPickPortFirst
source: Pick a COM port first.
ja_jp: まずCOMポートを選択してください。
zh_cn: 请先选择串口。

# MsgStoppingSerial
source: Stopping monitoring to free the serial port...
ja_jp: シリアルポートを解放するため監視を停止しています...
zh_cn: 正在停止监控以释放串口...

# MsgSerialOpen
source: Serial {0} open
ja_jp: シリアル {0} を開きました
zh_cn: 串口 {0} 已打开

# MsgSerialError
source: Serial error: {0}
ja_jp: シリアルエラー：{0}
zh_cn: 串口错误：{0}

# MsgBaseline
source: Baseline state {0} captured (apply-on-startup off)
ja_jp: 初期状態 {0} を取得しました（起動時適用オフ）
zh_cn: 已捕获初始状态 {0}（未开启启动应用）

# MsgApplyingRotation
source: Applying rotation dmdo={0}
ja_jp: 回転を適用中 dmdo={0}
zh_cn: 正在应用旋转 dmdo={0}

# MsgAppliedLandscape
source: Applied landscape
ja_jp: 横向きを適用しました
zh_cn: 已应用横屏

# MsgAppliedPortrait
source: Applied portrait
ja_jp: 縦向きを適用しました
zh_cn: 已应用竖屏

# MsgWallpaperNotFound
source: Wallpaper not found: {0}
ja_jp: 壁紙が見つかりません：{0}
zh_cn: 壁纸文件不存在：{0}

# MsgWallpaperBoth
source: Wallpaper (both): {0}
ja_jp: 壁紙（両方）：{0}
zh_cn: 壁纸（两台）：{0}

# MsgWallpaperMain
source: Wallpaper (main only): {0}
ja_jp: 壁紙（メインのみ）：{0}
zh_cn: 壁纸（仅主屏）：{0}

# MsgApplyFailed
source: Apply failed: {0}
ja_jp: 適用に失敗しました：{0}
zh_cn: 应用失败：{0}

# MsgDispChange
source: ChangeDisplaySettingsEx returned {0}
ja_jp: ChangeDisplaySettingsEx の戻り値 {0}
zh_cn: ChangeDisplaySettingsEx 返回 {0}

# MsgRestart
source: Restart
ja_jp: 再起動
zh_cn: 立即重启

# MsgCancel
source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# MsgLanguageChangedTitle
source: Restart required
ja_jp: 再起動が必要です
zh_cn: 需要重启

# MsgLanguageChangedBody
source: The language change applies after restart. Restart now?
ja_jp: 言語は再起動後に適用されます。すぐに再起動しますか？
zh_cn: 语言将在重启后生效。立即重启？

# SensorTitle
source: Sensor test (read-only)
ja_jp: センサーテスト（読み取り専用）
zh_cn: 传感器测试（只读）

# SensorLandscape
source: Landscape
ja_jp: 横向き
zh_cn: 横屏

# SensorPortrait90
source: Portrait (90°)
ja_jp: 縦向き（90°）
zh_cn: 竖屏（90°）

# SensorPortrait270
source: Portrait (270°)
ja_jp: 縦向き（270°）
zh_cn: 竖屏（270°）

# SensorBetween
source: Between positions
ja_jp: 中間位置
zh_cn: 中间位置

# SensorNoData
source: no data
ja_jp: データなし
zh_cn: 无数据

# SensorConnecting
source: connecting to {0}...
ja_jp: {0} に接続中...
zh_cn: 正在连接 {0}...

# SensorConnected
source: connected: {0}
ja_jp: 接続済み：{0}
zh_cn: 已连接：{0}

# SensorClosed
source: closed
ja_jp: 終了
zh_cn: 已关闭

# SensorError
source: serial error: {0}
ja_jp: シリアルエラー：{0}
zh_cn: 串口错误：{0}

# PortConnect
source: Connect
ja_jp: 接続
zh_cn: 连接

# PortDisconnect
source: Disconnect
ja_jp: 切断
zh_cn: 断开

# MsgConnectFirst
source: Connect to a COM port first.
ja_jp: 先にCOMポートへ接続してください。
zh_cn: 请先连接串口。

# AutoConnect
source: Auto-connect on startup
ja_jp: 起動時に自動接続
zh_cn: 启动时自动连接

# NavAbout
source: About
ja_jp: バージョン情報
zh_cn: 关于

# AboutVersion
source: Version: {0}
ja_jp: バージョン：{0}
zh_cn: 版本：{0}

# AboutRepo
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 仓库

# CheckUpdates
source: Check for updates
ja_jp: 更新を確認
zh_cn: 检查更新

# UpToDate
source: You have the latest version.
ja_jp: 最新バージョンです。
zh_cn: 已是最新版本。

# UpdateAvailable
source: Version {0} is available.
ja_jp: バージョン {0} が利用可能です。
zh_cn: 发现新版本 {0}。

# UpdateFailed
source: Could not check for updates.
ja_jp: 更新を確認できませんでした。
zh_cn: 无法检查更新。

# AboutNotConfigured
source: Set your repository URL in the source to enable update checks.
ja_jp: 更新確認を有効にするにはソースでリポジトリURLを設定してください。
zh_cn: 请在源码中设置仓库地址以启用更新检查。

# TrayShow
source: Show
ja_jp: 表示
zh_cn: 显示

# TrayExit
source: Exit
ja_jp: 終了
zh_cn: 退出

# TrayHint
source: Rotary is still running in the tray.
ja_jp: Rotary はトレイで実行中です。
zh_cn: Rotary 仍在托盘运行中。

# ExitButton
source: Exit
ja_jp: 終了
zh_cn: 退出

# CalStep1
source: Step 1 of 3 — Keep the monitor horizontal (landscape), then press Save baseline.
ja_jp: 手順 1/3 — モニターを横向きに保ち、「基準を保存」を押してください。
zh_cn: 第 1 步（共 3 步）——保持显示器水平（横屏），然后点击“保存基准”。

# CalBaseline
source: Save baseline
ja_jp: 基準を保存
zh_cn: 保存基准

# CalBaselineDone
source: Baseline captured: {0}°
ja_jp: 基準を取得しました：{0}°
zh_cn: 已捕获基准：{0}°

# CalStep2
source: Step 2 of 3 — Choose the rotation direction, then rotate the monitor to that position.
ja_jp: 手順 2/3 — 回転方向を選び、モニターをその位置まで回転してください。
zh_cn: 第 2 步（共 3 步）——选择旋转方向，然后将显示器旋转到该位置。

# CalDirCW
source: 90° — clockwise (right edge down)
ja_jp: 90° — 時計回り（右端が下）
zh_cn: 90° —— 顺时针（右边缘朝下）

# CalDirCCW
source: 270° — counterclockwise (left edge down)
ja_jp: 270° — 反時計回り（左端が下）
zh_cn: 270° —— 逆时针（左边缘朝下）

# CalStep3
source: Step 3 of 3 — Press Save rotation.
ja_jp: 手順 3/3 — 「回転を保存」を押してください。
zh_cn: 第 3 步（共 3 步）——点击“保存旋转”。

# CalSaveRot
source: Save rotation
ja_jp: 回転を保存
zh_cn: 保存旋转

# CalVerify
source: Detected rotation: {0}° (expected {1}°)
ja_jp: 検出した回転：{0}°（予想 {1}°）
zh_cn: 检测到旋转：{0}°（预期 {1}°）

# CalMismatch
source: Mismatch — detected {0}°, expected {1}°. Check the direction and try again.
ja_jp: 不一致 — 検出 {0}°、予想 {1}°。方向を確認してやり直してください。
zh_cn: 不匹配——检测到 {0}°，预期 {1}°。请检查方向后重试。

# EnableWallpaper
source: Change wallpaper when rotated
ja_jp: 回転時に壁紙を変更
zh_cn: 旋转时更换壁纸

# RotMonHeader
source: Rotation monitor
ja_jp: 回転モニター
zh_cn: 旋转显示器

# ChangeRestWallpaper
source: Change wallpaper on the other monitors
ja_jp: 他のモニターの壁紙を変更
zh_cn: 更换其他显示器的壁纸

# FollowRotWallpaper
source: Follow the rotation monitor's wallpaper (may crop)
ja_jp: 回転モニターの壁紙に合わせる（切り取りの可能性あり）
zh_cn: 跟随旋转显示器的壁纸（可能会被裁剪）

# RestLandscapeLabel
source: Other monitors — when the rotation monitor is landscape:
ja_jp: 他のモニター — 回転モニターが横向きの時：
zh_cn: 其他显示器 —— 当旋转显示器为横屏时：

# RestPortraitLabel
source: Other monitors — when the rotation monitor is portrait:
ja_jp: 他のモニター — 回転モニターが縦向きの時：
zh_cn: 其他显示器 —— 当旋转显示器为竖屏时：

# MsgWallpaperDisabled
source: Wallpaper change is disabled.
ja_jp: 壁紙の変更は無効です。
zh_cn: 壁纸更换已禁用。

# AboutFirmware
source: Firmware repository
ja_jp: ファームウェアリポジトリ
zh_cn: 固件仓库

# ViewLicenses
source: Third-party licenses
ja_jp: サードパーティーライセンス
zh_cn: 第三方许可证
